scribble.old/app/views/comments/_form.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
<%= form_for([@article, @article.comments.build]) do |f| %>
<% if @article.comments.build.errors.any? %>