scribble.old/app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "anusone"], ["body", "you suck"], ["article_id", 8], ["created_at", 2016-12-16 20:57:43 UTC], ["updated_at", 2016-12-16 20:57:43 UTC]]
---
   def create
     @article = Article.find(params[:article_id])
     @comment = @article.comments.create(comment_params)